Revit 2027 API
MEPSupportUtils Class
 General utility methods for the Autodesk Revit MEP Supporting components.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.MEPSupportUtils
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class MEPSupportUtils
Public NotInheritable Class MEPSupportUtils
public ref class MEPSupportUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type MEPSupportUtils = class end
The MEPSupportUtils type exposes the following members.
Methods
Name | Description
CreateDuctworkStiffener |  Create family based stiffener on the specified fabrication ductwork.
Top
See Also
Reference
Autodesk.Revit.DB Namespace